{
  "architectures": [
    "DebertaV2ForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "dtype": "float32",
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "ADHD",
    "1": "Anxiety",
    "2": "Autism",
    "3": "Bipolar",
    "4": "Depression",
    "5": "Normal",
    "6": "Personality_Disorder",
    "7": "Severe_Psychiatric_Disorders",
    "8": "Stress",
    "9": "Suicidal"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ADHD": 0,
    "Anxiety": 1,
    "Autism": 2,
    "Bipolar": 3,
    "Depression": 4,
    "Normal": 5,
    "Personality_Disorder": 6,
    "Severe_Psychiatric_Disorders": 7,
    "Stress": 8,
    "Suicidal": 9
  },
  "layer_norm_eps": 1e-07,
  "legacy": true,
  "max_position_embeddings": 512,
  "max_relative_positions": -1,
  "model_type": "deberta-v2",
  "norm_rel_ebd": "layer_norm",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "pooler_dropout": 0,
  "pooler_hidden_act": "gelu",
  "pooler_hidden_size": 768,
  "pos_att_type": [
    "p2c",
    "c2p"
  ],
  "position_biased_input": false,
  "position_buckets": 256,
  "relative_attention": true,
  "share_att_key": true,
  "transformers_version": "4.56.1",
  "type_vocab_size": 0,
  "vocab_size": 128100
}
